vacationme-artillery.yml
config:
  target: 'http://127.0.0.1:3001'
  http:
    pool: 100
  phases:
    - 
      duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - 
      duration: 600
      arrivalRate: 1000
      name: "Sustained max load"
scenarios:
  - flow:
    - get:
        url: "/listing/{{$randomNumber(1,10000000)}}"
    - get:
        url: "/api/details/{{$randomNumber(1,10000000)}}"